{
    "id": "mental_immunity_training",
    "name": "Mental Immunity Training",
    "description": "Developing mental resilience to withstand psychological attacks and emotional manipulation.",
    "focus": [
        "Cognitive Armor Building",
        "Emotional Resilience",
        "Self-Validation"
    ],
    "cards": [
        {
            "id": "mit_1",
            "title": "Developing Cognitive Armor",
            "description": "Creating mental defenses against psychological attacks.",
            "bulletpoints": [
                "Regularly exposing yourself to controlled stress builds resilience against real-world manipulation.",
                "Rehearsing mental counter-scripts helps prevent emotional hijacking by PSNs.",
                "Practicing skepticism allows you to detect and reject manipulative narratives before they take hold."
            ],
            "summaryText": "Train under controlled pressure to build real-world resistance, drill mental comebacks so hijacking attempts bounce off, and sharpen skepticism into a reflex that catches manipulation before it roots.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "mit_2",
            "title": "Emotional Resilience Against Manipulation",
            "description": "Training your emotions to remain unaffected by PSN tactics.",
            "bulletpoints": [
                "Recognizing and detaching from emotional baiting prevents PSNs from exploiting reactions.",
                "Reframing negative experiences into learning opportunities enhances long-term resistance.",
                "Practicing mindfulness reduces impulsive reactions to manipulative psychological triggers."
            ],
            "summaryText": "Spot bait and disengage before they can hook your emotions, turn every bad experience into a lesson that toughens you up, and use mindfulness to slow reactions so triggers misfire.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "mit_3",
            "title": "The Power of Self-Validation",
            "description": "Becoming psychologically self-sufficient to eliminate dependence on external validation.",
            "bulletpoints": [
                "Cultivating self-trust ensures external opinions do not dictate your self-worth.",
                "Developing a personal code of ethics creates an unshakable internal compass.",
                "Mastering the ability to self-assess negates the influence of PSN gaslighting tactics."
            ],
            "summaryText": "Build self-trust so deep that outside voices can't touch your worth, forge a personal ethics code that no one can bend, and perfect self-assessment to render gaslighting powerless.",
            "duration": "90",
            "difficulty": "Expert"
        }
    ]
}