{
    "id": "threat_assessment_models",
    "name": "Threat Assessment Models",
    "description": "Frameworks for evaluating potential security threats based on intelligence data.",
    "focus": [
        "Pattern Recognition",
        "Risk Analysis"
    ],
    "cards": [
        {
            "id": "link_analysis",
            "title": "Link Analysis & Network Mapping",
            "description": "Connecting data points to uncover hidden relationships.",
            "bulletpoints": [
                "Use network graph visualization tools to reveal associations between individuals, groups, and assets",
                "Analyze communications and financial transactions to identify covert networks",
                "Assess degrees of separation to detect central figures and hidden influencers within a threat network"
            ],
            "summaryText": "Map relational data to surface covert networks and spotlight pivotal actors for disruption.",
            "duration": 6,
            "difficulty": "Advanced"
        },
        {
            "id": "behavioral_risk_analysis",
            "title": "Behavioral Risk Analysis & Predictive Profiling",
            "description": "Evaluating behavioral trends to predict potential threats.",
            "bulletpoints": [
                "Identify pre-incident indicators by analyzing deviations from normal activity patterns",
                "Assess psychological and ideological motivations behind potential threat actors",
                "Use historical case studies to refine predictive threat models and escalation pathways"
            ],
            "summaryText": "Profile behavioral indicators and motivations to forecast which actors are most likely to escalate.",
            "duration": 7,
            "difficulty": "Advanced"
        },
        {
            "id": "attack_surface_analysis",
            "title": "Attack Surface Analysis & Vulnerability Assessment",
            "description": "Identifying weaknesses that adversaries could exploit.",
            "bulletpoints": [
                "Map out physical, cyber, and human vulnerabilities in an organization's security infrastructure",
                "Assess potential entry points that adversaries could use to launch an attack",
                "Develop mitigation strategies to reduce the likelihood of exploitation"
            ],
            "summaryText": "Survey physical, cyber, and human gaps to flag exploitable entry points and prioritize hardening.",
            "duration": 7,
            "difficulty": "Intermediate"
        },
        {
            "id": "threat_vector_modeling",
            "title": "Threat Vector Modeling & Adversarial Tactics",
            "description": "Evaluating the methods adversaries use to conduct attacks.",
            "bulletpoints": [
                "Analyze past attack methodologies to predict future threats",
                "Use the MITRE ATT&CK framework to classify adversary tactics and techniques",
                "Develop response plans based on known adversarial capabilities and motivations"
            ],
            "summaryText": "Classify adversary playbooks with ATT&CK to anticipate tactics and tailor proactive responses.",
            "duration": 8,
            "difficulty": "Advanced"
        },
        {
            "id": "risk_mitigation_strategies",
            "title": "Risk Mitigation Strategies & Intelligence-Based Decision Making",
            "description": "Creating security policies based on threat intelligence assessments.",
            "bulletpoints": [
                "Prioritize threats based on likelihood, impact, and available countermeasures",
                "Use intelligence-driven risk scoring models to refine security policies",
                "Integrate real-time threat intelligence feeds into proactive decision-making"
            ],
            "summaryText": "Rank threats by impact and fuse live intel feeds to drive adaptive, evidence-based policies.",
            "duration": 6,
            "difficulty": "Intermediate"
        }
    ]
}