{
    "id": "tactical_networking_against_psns",
    "name": "Tactical Networking Against PSNs",
    "description": "Creating secure and strategic alliances to counteract PSN infiltration at local and organizational levels.",
    "focus": [
        "Strategic Relationship Building",
        "Detecting PSN Operatives in Networks",
        "Forming Unbreakable Resistance Groups"
    ],
    "cards": [
        {
            "id": "tna_1",
            "title": "Identifying and Vetting Safe Allies",
            "description": "Ensuring that resistance efforts are not compromised by infiltrators.",
            "bulletpoints": [
                "Using trust-based verification systems before full inclusion in networks.",
                "Setting up layered security measures to detect infiltrators.",
                "Employing behavioral analysis to detect PSN operatives in disguise."
            ],
            "summaryText": "Gatekeep new allies with multi-step vetting, layer surveillance to spot infiltrators early, and continuously scan behaviors for the tells that give PSNs away.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "tna_2",
            "title": "Sealing Information Leaks in Resistance Groups",
            "description": "Preventing PSNs from accessing and manipulating private networks.",
            "bulletpoints": [
                "Utilizing compartmentalization to limit knowledge exposure.",
                "Implementing misinformation traps to identify internal threats.",
                "Training members in OPSEC to maintain secure communications."
            ],
            "summaryText": "Segment intel so no one person knows everything, lay false breadcrumbs to flush moles, and drill OPSEC habits until secure communication is second nature.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "tna_3",
            "title": "Countering PSN Social Sabotage Strategies",
            "description": "Identifying and neutralizing PSN efforts to divide and destabilize resistance movements.",
            "bulletpoints": [
                "Preemptively addressing false accusations and smear tactics.",
                "Reframing divisive issues to prevent internal fractures.",
                "Redirecting PSN-instigated conflicts toward constructive unity-building."
            ],
            "summaryText": "Call out smear attempts before they stick, reframe polarizing issues into shared goals, and flip PSN-triggered conflicts into opportunities for tighter unity.",
            "duration": "90",
            "difficulty": "Expert"
        }
    ]
}