{
    "id": "red_flag_detection",
    "name": "Red Flag Detection",
    "description": "Recognizing early warning signs of narcissists and manipulators before they infiltrate your life.",
    "focus": [
        "Behavioral Pattern Recognition",
        "Early Warning Systems"
    ],
    "cards": [
        {
            "id": "red_flag_1",
            "title": "Recognizing Narcissistic Microbehaviors",
            "description": "Identifying the subtle behaviors that reveal narcissistic tendencies before full manipulation begins.",
            "bulletpoints": [
                "Inconsistencies in words vs. actions create a pattern of deception.",
                "Love-bombing tactics overwhelm with excessive admiration to build control.",
                "Passive-aggressive control emerges through backhanded compliments and subtle digs."
            ],
            "summaryText": "Watch for mismatched words and actions, love-bombing, and subtle digs to spot narcissists before they dig in.",
            "duration": "60",
            "difficulty": "Intermediate"
        },
        {
            "id": "red_flag_2",
            "title": "Gaslighting and Deceptive Language",
            "description": "Learning to identify speech patterns and language tricks that narcissists use to distort reality.",
            "bulletpoints": [
                "Word salad conversations confuse by overwhelming with nonsensical language.",
                "Blame-shifting phrases redirect accountability onto the victim.",
                "Contradictory narratives expose a pattern of deception and manipulation."
            ],
            "summaryText": "Flag the word salad, blame shifts, and contradictions so their deceptive language can’t fog your reality.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "red_flag_3",
            "title": "Hidden Power Plays and Social Positioning",
            "description": "Understanding how narcissists infiltrate social groups, workplaces, and relationships using covert influence.",
            "bulletpoints": [
                "Triangulation tactics create unnecessary conflicts to divide and control.",
                "False humility is used as a manipulation tool to lower defenses.",
                "Social peacocking projects an exaggerated, curated image of success."
            ],
            "summaryText": "Notice triangulation, faux humility, and over-curated image plays—they’re early signs of covert power grabs.",
            "duration": "90",
            "difficulty": "Advanced"
        },
        {
            "id": "red_flag_4",
            "title": "The ‘Too Good to Be True’ Illusion",
            "description": "Identifying early-stage manipulative charm designed to disarm and ensnare victims.",
            "bulletpoints": [
                "Rapid intimacy builds false emotional depth to create dependency.",
                "Over-the-top compliments and exaggerated praise hide control intentions.",
                "Unrealistic promises and grand future faking set up an eventual betrayal."
            ],
            "summaryText": "Question the too-fast intimacy, lavish praise, and future faking before you get hooked into the illusion.",
            "duration": "75",
            "difficulty": "Intermediate"
        },
        {
            "id": "red_flag_5",
            "title": "Subtle Disrespect and Boundary Testing",
            "description": "Recognizing early violations of personal space, limits, and emotional autonomy.",
            "bulletpoints": [
                "Playful insults and backhanded jokes normalize emotional abuse.",
                "Boundary-pushing behavior gauges how much control can be exerted.",
                "Ignoring ‘no’ or dismissing concerns signals a lack of respect for autonomy."
            ],
            "summaryText": "Treat playful insults, boundary pushes, and ignored ‘no’s as bright warning flares of disrespect.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "red_flag_6",
            "title": "Creating Chaos and Drama Cycles",
            "description": "Understanding how manipulators manufacture emotional turmoil to gain leverage.",
            "bulletpoints": [
                "Manufactured crises keep attention focused on their needs and problems.",
                "Emotional whiplash alternates between affection and cruelty to create instability.",
                "Faked victimhood shifts blame and guilt onto others as a form of control."
            ],
            "summaryText": "See through manufactured crises, emotional whiplash, and faux victimhood before the chaos traps you.",
            "duration": "90",
            "difficulty": "Advanced"
        },
        {
            "id": "red_flag_7",
            "title": "Excessive Secrecy and Hidden Agendas",
            "description": "Spotting the signs of a manipulator’s double life and concealed motivations.",
            "bulletpoints": [
                "Vague answers and evasive speech hide deeper deception.",
                "Frequent contradictions reveal an ever-changing, false narrative.",
                "Compartmentalized relationships prevent outsiders from seeing the full truth."
            ],
            "summaryText": "Track evasive answers, contradictions, and compartmentalized circles to expose the hidden agenda.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "red_flag_8",
            "title": "Weaponized Insecurity and Projection",
            "description": "Recognizing when manipulators reflect their own flaws onto others.",
            "bulletpoints": [
                "Accusations of dishonesty often signal a liar projecting their own guilt.",
                "Frequent comparisons diminish self-worth and increase dependency.",
                "Shaming techniques weaken emotional resilience and enforce compliance."
            ],
            "summaryText": "Recognize projection, constant comparisons, and shaming—they weaponize your insecurity for control.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "red_flag_9",
            "title": "Financial and Resource Exploitation",
            "description": "Identifying financial red flags that indicate a narcissist’s self-serving motives.",
            "bulletpoints": [
                "Early money discussions hint at financial dependency traps.",
                "Refusing to reciprocate favors signals an entitlement mindset.",
                "Sudden financial crises demand urgent assistance as a control tactic."
            ],
            "summaryText": "Spot the money talk, one-way favors, and sudden financial emergencies as resource-grab red flags.",
            "duration": "90",
            "difficulty": "Advanced"
        },
        {
            "id": "red_flag_10",
            "title": "Identifying Hidden Covert Narcissists",
            "description": "Spotting the warning signs of manipulative individuals who operate in stealth mode.",
            "bulletpoints": [
                "Feigning victimhood diverts attention from their manipulative actions.",
                "False humility is used to disguise a deeply rooted superiority complex.",
                "Excessive self-sacrifice narratives generate unearned loyalty and obligation."
            ],
            "summaryText": "Identify covert narcissists by the martyr stories, fake humility, and constant victim posturing.",
            "duration": "90",
            "difficulty": "Expert"
        }
    ]
}