{
    "id": "activating_collective_resistance",
    "name": "Activating Collective Resistance",
    "description": "Mobilizing communities and grassroots movements to counter PSN infiltration and control.",
    "focus": [
        "Organizing Local Resistance",
        "Developing Collective Defense Strategies",
        "Disrupting PSN Social Dominance"
    ],
    "cards": [
        {
            "id": "acr_1",
            "title": "Building a Decentralized Resistance Network",
            "description": "Creating a structure that is resistant to PSN infiltration and disruption.",
            "bulletpoints": [
                "Avoiding centralized leadership to prevent targeted takeovers.",
                "Implementing communication security measures to limit PSN interference.",
                "Training members to recognize and resist psychological manipulation."
            ],
            "summaryText": "Organize as distributed cells, lock down communications with secure channels, and drill everyone on spotting manipulation so no single breach can topple the network.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "acr_2",
            "title": "Strength in Numbers: Organizing Psychological Defense Units",
            "description": "Structuring small, adaptable groups that reinforce each other’s defenses against PSN tactics.",
            "bulletpoints": [
                "Assigning specific roles to maximize operational efficiency and trust.",
                "Utilizing rapid response strategies to counter PSN disinformation.",
                "Encouraging mental resilience training to fortify group members."
            ],
            "summaryText": "Give each member a defined role, launch swift counter-messaging the moment disinformation hits, and keep the whole unit running resilience drills so morale stays unbreakable.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "acr_3",
            "title": "Turning the Crowd Against PSNs",
            "description": "Redirecting group influence to neutralize PSN social control.",
            "bulletpoints": [
                "Using social proof to discredit PSN narratives.",
                "Implementing collective call-out tactics without direct confrontation.",
                "Leveraging community-driven decision-making to prevent PSN influence."
            ],
            "summaryText": "Mobilize the crowd’s social proof to flip their story, coordinate calm collective call-outs, and keep choices in transparent community forums so PSNs can’t grab control.",
            "duration": "90",
            "difficulty": "Expert"
        }
    ]
}