{
    "id": "psychological_operations",
    "name": "Psychological Operations",
    "description": "Using behavioral psychology to influence, manipulate, and control outcomes in intelligence settings.",
    "focus": [
        "Behavioral Manipulation",
        "Cognitive Influence"
    ],
    "cards": [
        {
            "id": "coercion_and_persuasion",
            "title": "Coercion and Persuasion Tactics",
            "description": "Psychological methods for influencing decisions and altering behaviors.",
            "bulletpoints": [
                "Apply social engineering techniques such as pretexting, baiting, and authority exploitation to gain trust and extract information",
                "Use framing (shaping how information is presented) and priming (subconscious influence) to steer perception and decision-making",
                "Leverage psychological motivators like fear, obligation, and guilt to increase compliance and reduce resistance"
            ],
            "summaryText": "Blend social engineering, framing, and emotional levers to press targets into desired choices.",
            "duration": 6,
            "difficulty": "Advanced"
        },
        {
            "id": "psyops_strategies",
            "title": "Strategic Psychological Operations",
            "description": "Coordinating large-scale psychological campaigns to shift perceptions and create division.",
            "bulletpoints": [
                "Use propaganda techniques such as repetition, emotional appeal, and selective information to shape public opinion",
                "Exploit cognitive biases, including confirmation bias (favoring information that aligns with existing beliefs) and bandwagon effect (influencing behavior through social proof), to manipulate adversarial groups",
                "Deploy misinformation (false or misleading information) and disinformation (deliberately deceptive content) to undermine opponents and control narratives"
            ],
            "summaryText": "Layer propaganda loops, leverage bias shortcuts, and seed disinformation to fracture enemy narratives.",
            "duration": 7,
            "difficulty": "Advanced"
        },
        {
            "id": "perception_management",
            "title": "Perception Management & Narrative Control",
            "description": "Shaping how individuals or groups interpret events to guide behavior and decision-making.",
            "bulletpoints": [
                "Construct narratives (coherent, persuasive storylines) that align with strategic objectives and influence emotions",
                "Use media manipulation tactics such as selective reporting, false attribution, and staged events to control information flow",
                "Apply subliminal messaging (hidden persuasive cues) and neuro-linguistic programming (NLP) (language-based influence) to shape perception at a subconscious level"
            ],
            "summaryText": "Craft emotionally charged narratives, steer media optics, and slip in subliminal cues to steer perception.",
            "duration": 7,
            "difficulty": "Expert"
        },
        {
            "id": "group_psychology_manipulation",
            "title": "Group Psychology & Mass Influence",
            "description": "Exploiting group dynamics to amplify psychological control.",
            "bulletpoints": [
                "Leverage groupthink (desire for harmony leading to poor decision-making) to push targeted narratives within closed communities",
                "Use moral disengagement techniques (justifying unethical actions) to radicalize individuals and encourage ideological commitment",
                "Implement identity reinforcement strategies, such as in-group favoritism and out-group demonization, to strengthen group cohesion and create division"
            ],
            "summaryText": "Exploit groupthink, moral disengagement, and identity reinforcement to mobilize crowds around your agenda.",
            "duration": 8,
            "difficulty": "Advanced"
        },
        {
            "id": "subversion_and_psychological_warfare",
            "title": "Subversion & Psychological Warfare",
            "description": "Undermining adversaries through psychological destabilization.",
            "bulletpoints": [
                "Deploy active measures (covert actions like forgeries, leaked documents, and false intelligence) to weaken enemy credibility",
                "Use emotional exhaustion tactics such as relentless fear, uncertainty, and doubt (FUD) campaigns to wear down adversarial resolve",
                "Exploit information overload (flooding adversaries with conflicting data) to induce confusion and paralysis in decision-making"
            ],
            "summaryText": "Combine active measures, sustained FUD, and data deluges to break adversary focus and cohesion.",
            "duration": 9,
            "difficulty": "Expert"
        }
    ]
}