{
    "id": "psychological_warfare_tactics",
    "name": "Psychological Warfare Tactics",
    "description": "Strategic methods for dismantling the psychological influence of PSNs.",
    "focus": [
        "Cognitive Disruption",
        "Reversing Manipulation",
        "Strategic Deconstruction of PSN Control"
    ],
    "cards": [
        {
            "id": "pwt_1",
            "title": "Undermining the PSN’s Psychological Grip",
            "description": "Disrupting their influence over individuals and groups.",
            "bulletpoints": [
                "Using contradictory information to weaken their credibility among followers.",
                "Encouraging independent critical thinking in their social circles to dissolve blind obedience.",
                "Subtly reinforcing alternative viewpoints that destabilize their control."
            ],
            "summaryText": "Seed contradictions that crack their credibility with believers, spark independent thinking in their circles to melt away blind loyalty, and quietly amplify rival viewpoints that undermine their grip.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "pwt_2",
            "title": "Weaponizing Truth Against PSNs",
            "description": "Turning their own narratives against them using factual exposure.",
            "bulletpoints": [
                "Identifying their core manipulative lies and methodically exposing them.",
                "Using Socratic questioning to lead them into self-contradictions.",
                "Ensuring public exposure of their behavior in a way that prevents them from regaining control."
            ],
            "summaryText": "Target their key lies and dismantle them piece by piece, ask Socratic questions that walk them into traps of their own making, and expose them publicly in ways that lock them out of recovery.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "pwt_3",
            "title": "Destabilizing the PSN’s Psychological Operations",
            "description": "Using tactical psychological counters to break their influence.",
            "bulletpoints": [
                "Mirroring their manipulation back at them while remaining ethically sound.",
                "Deploying social pressure reversal to shift their perceived power dynamic.",
                "Encouraging cognitive dissonance among their followers to erode their authority."
            ],
            "summaryText": "Reflect their tactics back at them without crossing ethical lines, reverse social pressure to flip the power dynamic, and plant cognitive dissonance in followers to chip away at their authority.",
            "duration": "90",
            "difficulty": "Expert"
        }
    ]
}