{
    "id": "protecting_against_manipulation",
    "name": "Protecting Against Manipulation",
    "description": "Developing effective defenses against narcissistic tactics before they take root.",
    "focus": [
        "Setting Boundaries",
        "Avoiding Emotional Traps",
        "Psychological Self-Defense"
    ],
    "cards": [
        {
            "id": "pam_1",
            "title": "Establishing Strong Personal Boundaries",
            "description": "Preventing narcissists from exploiting kindness and empathy.",
            "bulletpoints": [
                "Clearly define personal boundaries and enforce them consistently.",
                "Avoid justifying or over-explaining boundaries to manipulators.",
                "Recognize when someone is testing your limits for future exploitation."
            ],
            "summaryText": "Set clear lines and hold them without negotiation, don't explain or defend your boundaries to people fishing for loopholes, and recognize the testing phase before they learn what they can get away with.",
            "duration": "75",
            "difficulty": "Intermediate"
        },
        {
            "id": "pam_2",
            "title": "Resisting Emotional Baiting",
            "description": "Neutralizing tactics designed to provoke emotional reactions.",
            "bulletpoints": [
                "Narcissists use baiting to extract emotional responses for control.",
                "Practice non-reactivity and disengagement in high-stress interactions.",
                "Redirect conversations and avoid feeding into manipulative cycles."
            ],
            "summaryText": "Understand bait is meant to yank your emotions and hand over control, stay flat and disengaged when they escalate to provoke you, and steer away from loops designed to trap you in endless drama.",
            "duration": "75",
            "difficulty": "Intermediate"
        },
        {
            "id": "pam_3",
            "title": "Psychological Self-Defense Mechanisms",
            "description": "Strengthening mental resilience to prevent narcissistic influence.",
            "bulletpoints": [
                "Maintain strong self-awareness to detect subtle manipulation.",
                "Use cognitive distancing to avoid internalizing false narratives.",
                "Reinforce self-trust and avoid seeking validation from manipulators."
            ],
            "summaryText": "Keep sharp self-awareness so you catch manipulation the moment it starts, hold mental distance to prevent their lies from colonizing your thoughts, and trust your own judgment instead of seeking their approval.",
            "duration": "90",
            "difficulty": "Advanced"
        }
    ]
}