{
    "id": "social_media_monitoring",
    "name": "Social Media Monitoring",
    "description": "Tracking, analyzing, and extracting intelligence from social media platforms.",
    "focus": [
        "Social Media Analysis",
        "Network Mapping",
        "Sentiment Analysis",
        "User Profiling",
        "Real-Time Threat Intelligence"
    ],
    "cards": [
        {
            "id": "trend_tracking",
            "title": "Trend Tracking and Hashtag Monitoring",
            "description": "Identifying emerging trends and real-time intelligence from social media.",
            "bulletpoints": [
                "Use Twitter API and sentiment analysis for trend detection",
                "Track hashtags and geotagged posts for live event monitoring",
                "Identify influencers and key opinion leaders in information networks"
            ],
            "summaryText": "Monitor hashtags and geotags to surface live events and the influencers amplifying them.",
            "duration": 6,
            "difficulty": "Intermediate"
        },
        {
            "id": "profile_attribution",
            "title": "Profile Attribution and Fake Account Detection",
            "description": "Identifying and verifying user profiles across multiple platforms.",
            "bulletpoints": [
                "Cross-reference accounts using username correlation techniques",
                "Analyze profile behavior and post timing for bot detection",
                "Use reverse image searches to trace profile pictures and avatars"
            ],
            "summaryText": "Correlate handles, posting rhythms, and imagery to unmask fake or linked personas.",
            "duration": 7,
            "difficulty": "Advanced"
        },
        {
            "id": "geotag_tracking",
            "title": "Geotag Tracking and Location Intelligence",
            "description": "Extracting geolocation data from social media content.",
            "bulletpoints": [
                "Use EXIF metadata to extract GPS coordinates from images",
                "Analyze geotagged tweets and Instagram posts for real-time location tracking",
                "Cross-reference location data with Google Earth and OpenStreetMap"
            ],
            "summaryText": "Extract geo metadata to follow movements and confirm locations in near real time.",
            "duration": 6,
            "difficulty": "Advanced"
        },
        {
            "id": "deepfake_detection",
            "title": "Deepfake and Manipulated Media Detection",
            "description": "Identifying and analyzing AI-generated and manipulated media content.",
            "bulletpoints": [
                "Use tools like Deepware Scanner and Sensity AI to detect deepfakes",
                "Analyze inconsistencies in facial movements, lighting, and reflections",
                "Compare suspected deepfake videos to original source footage"
            ],
            "summaryText": "Pair detection tools with visual forensics to validate or debunk deepfake media.",
            "duration": 7,
            "difficulty": "Advanced"
        },
        {
            "id": "telegram_osint",
            "title": "Telegram Intelligence Gathering",
            "description": "Extracting intelligence from Telegram channels and groups.",
            "bulletpoints": [
                "Use tools like Telegago and TGStat to search and analyze public channels",
                "Monitor extremist groups and underground marketplaces",
                "Identify admin locations and network structures in encrypted groups"
            ],
            "summaryText": "Mine Telegram analytics to map group hierarchies, admins, and illicit chatter.",
            "duration": 7,
            "difficulty": "Advanced"
        },
        {
            "id": "dark_social_monitoring",
            "title": "Dark Social Monitoring",
            "description": "Tracking information shared through private social media channels.",
            "bulletpoints": [
                "Analyze encrypted platforms like Signal and WhatsApp using metadata analysis",
                "Use link shortening analytics to track hidden URL shares",
                "Monitor Discord and private Facebook groups for threat intelligence"
            ],
            "summaryText": "Leverage metadata and link intel to watch conversations spilling across dark social channels.",
            "duration": 7,
            "difficulty": "Advanced"
        },
        {
            "id": "twitter_scraping",
            "title": "Scraping Twitter Data Without an API",
            "description": "Extracting real-time intelligence from Twitter without API restrictions.",
            "bulletpoints": [
                "Use Twint for Python-based Twitter scraping",
                "Monitor deleted tweets and sentiment changes over time",
                "Analyze Twitter spaces and voice chat logs for intelligence gathering"
            ],
            "summaryText": "Scrape Twitter without the API to capture real-time and deleted activity trends.",
            "duration": 6,
            "difficulty": "Intermediate"
        },
        {
            "id": "sockpuppet_accounts",
            "title": "Creating and Managing Sockpuppet Accounts",
            "description": "Building effective alias accounts for covert research and engagement.",
            "bulletpoints": [
                "Use identity obfuscation techniques to prevent tracking",
                "Simulate natural activity to avoid platform bans",
                "Use disposable email and phone numbers to create persistent personas"
            ],
            "summaryText": "Craft resilient sockpuppets with obfuscated credentials and believable engagement patterns.",
            "duration": 6,
            "difficulty": "Advanced"
        },
        {
            "id": "reddit_investigation",
            "title": "Extracting Intelligence from Reddit",
            "description": "Using Reddit’s vast discussion networks for OSINT investigations.",
            "bulletpoints": [
                "Use Pushshift.io for historical Reddit data analysis",
                "Track subreddit activity related to underground markets and extremist groups",
                "Analyze deleted comments and user post histories"
            ],
            "summaryText": "Tap Pushshift and subreddit histories to map communities and recover deleted intel.",
            "duration": 5,
            "difficulty": "Intermediate"
        },
        {
            "id": "youtube_osint",
            "title": "YouTube Data Analysis for OSINT",
            "description": "Extracting intelligence from YouTube videos and user behavior.",
            "bulletpoints": [
                "Analyze metadata, upload history, and geotagged locations",
                "Track user engagement and comment sentiment for trend analysis",
                "Reverse-search YouTube thumbnails for origin tracking"
            ],
            "summaryText": "Interrogate YouTube metadata and engagement to trace narratives and content sources.",
            "duration": 6,
            "difficulty": "Intermediate"
        },
        {
            "id": "sentiment_analysis",
            "title": "Sentiment Analysis for Social Media",
            "description": "Analyzing public sentiment and behavioral shifts through social media posts.",
            "bulletpoints": [
                "Use AI-based NLP tools like VADER and TextBlob for sentiment analysis",
                "Detect propaganda campaigns and disinformation trends",
                "Track spikes in emotional engagement to predict social unrest"
            ],
            "summaryText": "Apply NLP to social feeds to flag propaganda surges and unrest precursors.",
            "duration": 7,
            "difficulty": "Advanced"
        },
        {
            "id": "tiktok_investigation",
            "title": "TikTok Intelligence Gathering",
            "description": "Extracting intelligence from TikTok videos and user interactions.",
            "bulletpoints": [
                "Track geolocation and engagement metrics for emerging trends",
                "Use TikTok’s API and OSINT tools to monitor influencer activity",
                "Analyze comments and hashtags for political or social sentiment shifts"
            ],
            "summaryText": "Monitor TikTok metrics and hashtags to catch fast-moving narratives and actors.",
            "duration": 5,
            "difficulty": "Intermediate"
        },
        {
            "id": "facebook_groups_monitoring",
            "title": "Monitoring Private Facebook Groups",
            "description": "Gaining intelligence from closed and private social networks.",
            "bulletpoints": [
                "Analyze engagement patterns in restricted Facebook communities",
                "Use group metadata and admin tracking for lead generation",
                "Identify coordinated misinformation campaigns and threat actors"
            ],
            "summaryText": "Study private Facebook group dynamics to surface coordinated campaigns and leads.",
            "duration": 6,
            "difficulty": "Advanced"
        },
        {
            "id": "dark_web_social",
            "title": "Dark Web Social Media Monitoring",
            "description": "Tracking criminal and extremist networks on dark web forums.",
            "bulletpoints": [
                "Use Tor-based search engines to locate hidden forums",
                "Analyze dark web marketplaces and social networks",
                "Cross-reference darknet user activity with surface web accounts"
            ],
            "summaryText": "Track dark web social hubs and correlate handles back to surface identities.",
            "duration": 8,
            "difficulty": "Expert"
        }
    ]
}