{
    "id": "tactics_and_behavioral_traits",
    "name": "Tactics and Behavioral Traits",
    "description": "Recognizing the unique psychological and behavioral patterns of each type.",
    "focus": [
        "Manipulation Tactics",
        "Deception and Control Mechanisms",
        "Psychological Warfare Strategies"
    ],
    "cards": [
        {
            "id": "tbt_1",
            "title": "Psychopathic Control Tactics",
            "description": "How psychopaths use logic and detachment to dominate their targets.",
            "bulletpoints": [
                "Psychopaths engineer social environments where they maintain absolute control.",
                "They target high-value assets and relationships for long-term strategic manipulation.",
                "Their ability to mask emotions makes them nearly undetectable in professional settings."
            ],
            "summaryText": "See how they architect entire social spaces to guarantee control, understand they cherry-pick valuable targets for long-haul manipulation, and realize their emotional masking makes them nearly invisible in professional contexts.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "tbt_2",
            "title": "Sociopathic Outbursts and Unpredictability",
            "description": "Understanding how sociopaths use intimidation and aggression as weapons.",
            "bulletpoints": [
                "Sociopaths rely on fear and immediate dominance to maintain control.",
                "They use reckless, violent behavior as a psychological deterrent.",
                "Their inability to control impulses makes them susceptible to exposure through self-destruction."
            ],
            "summaryText": "Recognize fear and instant dominance as their control mechanism, see reckless violence as a scare tactic, and wait for their impulse-control failures to trigger self-destructive exposure.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "tbt_3",
            "title": "The Narcissist’s Social Warfare",
            "description": "How narcissists manipulate groups and social environments for control.",
            "bulletpoints": [
                "Narcissists rely on triangulation—pitting people against each other to maintain dominance.",
                "They play the victim to gain sympathy and social reinforcement.",
                "Exposing their contradictions in front of an audience is an effective way to neutralize their power."
            ],
            "summaryText": "Catch them setting people against each other to stay on top, see the victim act as a ploy for sympathy and backup, and destroy their power by revealing contradictions publicly where the crowd can witness.",
            "duration": "75",
            "difficulty": "Advanced"
        }
    ]
}