{
    "id": "threat_behavior_assessment",
    "name": "Threat Behavior Assessment",
    "description": "Assessing behavioral indicators of potential security threats and violent actors.",
    "focus": [
        "Threat Prediction",
        "Risk Assessment"
    ],
    "cards": [
        {
            "id": "pre_attack_indicators",
            "title": "Pre-Attack Indicators & Behavioral Cues",
            "description": "Recognizing signs of impending violent or terrorist activity.",
            "bulletpoints": [
                "Analyze shifts in routine behaviors and erratic movements",
                "Detect radicalization and extremist ideologies through speech patterns",
                "Assess last-minute changes in financial transactions and communications"
            ],
            "summaryText": "Track routine changes, extremist rhetoric, and late-stage financial signals to flag imminent violence.",
            "duration": 6,
            "difficulty": "Advanced"
        },
        {
            "id": "workplace_and_public_threats",
            "title": "Workplace & Public Space Threat Assessments",
            "description": "Identifying and mitigating threats in civilian and organizational environments.",
            "bulletpoints": [
                "Evaluate employee behavioral changes for insider threats",
                "Monitor public spaces for indicators of potential attacks",
                "Coordinate predictive threat modeling with intelligence agencies"
            ],
            "summaryText": "Blend insider monitoring, public surveillance, and modeling partnerships to blunt civil-space threats.",
            "duration": 7,
            "difficulty": "Advanced"
        },
        {
            "id": "psychological_red_flags",
            "title": "Psychological Red Flags in Threat Profiling",
            "description": "Understanding psychological markers that indicate a potential threat actor.",
            "bulletpoints": [
                "Identify escalating grievances and personal vendettas",
                "Recognize paranoia, grandiosity, and fixation on violent ideologies",
                "Analyze behavioral patterns related to narcissistic and antisocial disorders"
            ],
            "summaryText": "Spot festering grievances, distorted beliefs, and disorder cues to spotlight rising risks.",
            "duration": 6,
            "difficulty": "Intermediate"
        },
        {
            "id": "social_media_risk_assessment",
            "title": "Social Media & Digital Footprint Risk Assessment",
            "description": "Using online behavior analysis to predict threats and violent intent.",
            "bulletpoints": [
                "Monitor social media for hate speech, radicalization, and manifestos",
                "Identify coded language, dog whistles, and extremist recruitment tactics",
                "Analyze digital footprints to track behavioral escalation"
            ],
            "summaryText": "Scrape feeds for hate rhetoric, decode dog whistles, and timeline digital traces for escalation.",
            "duration": 8,
            "difficulty": "Advanced"
        },
        {
            "id": "group_dynamics_and_mob_behavior",
            "title": "Group Dynamics & Mob Behavior in Security Threats",
            "description": "Understanding the role of social influence in radicalization and violent events.",
            "bulletpoints": [
                "Assess groupthink, deindividuation, and escalation in hostile crowds",
                "Identify how extremist groups manipulate emotions for recruitment",
                "Use predictive modeling to assess the likelihood of coordinated attacks"
            ],
            "summaryText": "Evaluate mob psychology, emotional manipulation, and models to foresee group-based attacks.",
            "duration": 7,
            "difficulty": "Advanced"
        },
        {
            "id": "lone_actor_threat_profiles",
            "title": "Lone Actor Threat Profiles & Risk Indicators",
            "description": "Profiling individuals who act independently in carrying out violent threats.",
            "bulletpoints": [
                "Identify behavioral traits of lone wolf attackers",
                "Understand the psychological differences between organized groups and individual threats",
                "Recognize social isolation, grievance accumulation, and radicalization pathways"
            ],
            "summaryText": "Isolate lone-wolf signatures, contrast them with cell dynamics, and trace grievance-to-attack journeys.",
            "duration": 7,
            "difficulty": "Advanced"
        },
        {
            "id": "threat_communication_patterns",
            "title": "Threat Communication Patterns & Warning Behaviors",
            "description": "Analyzing verbal and nonverbal communication cues of potential attackers.",
            "bulletpoints": [
                "Detect verbal leaks and unintentional self-incrimination in threat actors",
                "Analyze facial microexpressions and body language for deception and intent",
                "Recognize linguistic patterns that signal ideological extremism or violent planning"
            ],
            "summaryText": "Parse threat language and microexpressions for leaks that betray violent intent.",
            "duration": 8,
            "difficulty": "Expert"
        },
        {
            "id": "pre_criminal_behavioral_analysis",
            "title": "Pre-Criminal Behavioral Analysis",
            "description": "Using behavioral analysis techniques to predict and prevent violent crimes.",
            "bulletpoints": [
                "Study precursor behaviors that lead to violent action",
                "Utilize behavioral drift analysis to detect increasing risk factors",
                "Differentiate between fantasy-driven threats and operationally capable individuals"
            ],
            "summaryText": "Chart precursors, measure behavioral drift, and separate fantasists from operational actors.",
            "duration": 9,
            "difficulty": "Expert"
        }
    ]
}