{
    "id": "narcissist_proofing_your_life",
    "name": "Narcissist Proofing Your Life",
    "description": "Developing a personal and professional life structure that is impenetrable to Psychopaths, Sociopaths, and Narcissists.",
    "focus": [
        "Boundary Enforcement",
        "Social Vetting Systems",
        "Psychological Immunity"
    ],
    "cards": [
        {
            "id": "npyl_1",
            "title": "Building Unbreakable Boundaries",
            "description": "Establishing and reinforcing personal boundaries that narcissists cannot manipulate.",
            "bulletpoints": [
                "Identifying and fortifying weak spots in your personal boundaries.",
                "Using verbal and non-verbal cues to enforce clear psychological distance.",
                "Deploying zero-tolerance policies for emotional manipulation and gaslighting."
            ],
            "summaryText": "Audit every gap in your defenses, telegraph your boundaries through tone and body language that brooks zero negotiation, then enforce instant consequences for any manipulation or gaslight attempt—no warnings.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "npyl_2",
            "title": "Social Circle and Relationship Vetting",
            "description": "Implementing a filtering process to prevent toxic individuals from entering your life.",
            "bulletpoints": [
                "Recognizing red flags early before emotional investment occurs.",
                "Developing a step-by-step trust test for new relationships.",
                "Utilizing controlled disclosures to gauge emotional safety."
            ],
            "summaryText": "Spot red flags the moment they appear, run new connections through escalating trust tests that reveal character over time, and drop strategic disclosures to see how they handle vulnerability—filter ruthlessly.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "npyl_3",
            "title": "The Psychological Firewall",
            "description": "Training your mind to instinctively detect and reject narcissistic manipulation.",
            "bulletpoints": [
                "Installing subconscious pattern recognition for PSN behaviors.",
                "Building emotional resilience to resist love-bombing and false validation.",
                "Mastering mental disengagement from narcissistic projections and distortions."
            ],
            "summaryText": "Train your brain to auto-detect PSN patterns before you're consciously aware, harden yourself against charm offensives and flattery traps, and disengage mentally so their projections slide off without landing.",
            "duration": "90",
            "difficulty": "Expert"
        }
    ]
}