{
    "id": "identifying_redeemable_individuals",
    "name": "Identifying Redeemable Individuals",
    "description": "How to determine which PSN operatives can be turned and which ones are irredeemable threats.",
    "focus": [
        "Assessing Psychological Flexibility",
        "Analyzing Loyalty Structures",
        "Spotting Disillusionment"
    ],
    "cards": [
        {
            "id": "iri_1",
            "title": "The Fence-Sitters",
            "description": "Detecting those who are ideologically aligned but lack deep commitment.",
            "bulletpoints": [
                "Many PSN recruits adopt beliefs as a survival mechanism rather than true conviction.",
                "Observing inconsistent behavior reveals potential doubts in their commitment.",
                "Those who hesitate when executing PSN doctrine are prime candidates for conversion."
            ],
            "summaryText": "Spot the ones who parrot beliefs for survival not conviction, watch for inconsistent behavior that betrays inner doubt, and target anyone who hesitates during PSN actions as ripe for flipping.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "iri_2",
            "title": "The Disillusioned",
            "description": "Finding operatives who have already experienced betrayal within the PSN system.",
            "bulletpoints": [
                "PSNs use loyalty until it is no longer convenient—many members become disposable assets.",
                "Identifying those who have been discarded or mistreated creates opportunities for defection.",
                "Exposing hidden betrayals within the organization fuels discontent."
            ],
            "summaryText": "Understand PSNs discard loyalists once they're inconvenient, find the ones who've been used and dumped as prime defection targets, and fan discontent by revealing internal betrayals they didn't know about.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "iri_3",
            "title": "The Loyal but Discontent",
            "description": "Recognizing those who outwardly support the PSN structure but harbor internal grievances.",
            "bulletpoints": [
                "High-ranking PSNs often grow frustrated with internal politics and power struggles.",
                "Providing an alternative that offers them more personal agency increases defection likelihood.",
                "Appealing to their self-interest can override ideological loyalty."
            ],
            "summaryText": "Spot high-rankers exhausted by internal politics and turf wars, offer them more autonomy and control as an exit incentive, and appeal to naked self-interest to override any ideological glue.",
            "duration": "90",
            "difficulty": "Expert"
        }
    ]
}