{
    "id": "cognitive_fortification_techniques",
    "name": "Cognitive Fortification Techniques",
    "description": "Developing advanced cognitive resilience to prevent PSNs from infiltrating thought processes.",
    "focus": [
        "Strengthening Mental Defenses",
        "Disrupting Thought Intrusion",
        "Fortifying Rational Autonomy"
    ],
    "cards": [
        {
            "id": "cft_1",
            "title": "Building an Impenetrable Cognitive Firewall",
            "description": "Blocking manipulative influence before it enters the subconscious.",
            "bulletpoints": [
                "Identifying linguistic cues that indicate manipulation attempts.",
                "Using critical thinking patterns to prevent narrative implantation.",
                "Practicing meta-cognition to recognize external influence."
            ],
            "summaryText": "Catalog the language that hints at manipulation, run every claim through your critical-thinking filters, and stay meta-aware so outside voices never slip past your guard.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "cft_2",
            "title": "Reinforcing Logical Independence",
            "description": "Training the mind to prioritize logic over emotional coercion.",
            "bulletpoints": [
                "Identifying emotional hijacking and separating logic from impulse.",
                "Strengthening reality-testing skills to detect falsified perceptions.",
                "Developing mental algorithms for filtering information integrity."
            ],
            "summaryText": "Spot the exact moment emotion tries to steer you, cross-check reality before believing it, and run all inputs through a personal logic algorithm that flags bad data.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "cft_3",
            "title": "Mental Discipline and Cognitive Autonomy",
            "description": "Eliminating vulnerabilities that allow PSNs to control thought patterns.",
            "bulletpoints": [
                "Creating mental compartmentalization techniques to prevent forced thought shifts.",
                "Practicing controlled exposure to manipulation tactics to build immunity.",
                "Developing higher-order reasoning to dismantle deceptive framing."
            ],
            "summaryText": "Partition your thoughts so intrusions can’t spread, expose yourself to their tactics in controlled reps until they lose sting, and lean on high-level reasoning to tear apart every deceptive frame.",
            "duration": "90",
            "difficulty": "Expert"
        }
    ]
}