{
    "id": "psi_field_fundamentals",
    "name": "Psi Field Fundamentals",
    "description": "An introduction to the fundamental concepts of Psi Energy, Psi Fields, and their interactions with consciousness and physical reality.",
    "focus": [
        "Psi Energy Principles",
        "Field Interactions",
        "Energy Density Models",
        "Consciousness & Psi Phenomena"
    ],
    "cards": [
        {
            "id": "what_is_psi_energy",
            "title": "What is Psi Energy?",
            "description": "Understanding the fundamental concept of Psi Energy and its role in psychic phenomena.",
            "bulletpoints": [
                "Psi Energy is theorized as a non-physical energy influencing consciousness, perception, and telepathic interactions.",
                "Unlike electromagnetic or kinetic energy, Psi Energy interacts with thoughts, emotions, and intention.",
                "Explores how Psi Energy is perceived, harnessed, and measured in various esoteric and scientific models."
            ],
            "duration": 6,
            "difficulty": "Beginner"
        },
        {
            "id": "what_is_psi_field",
            "title": "What is the Psi Field?",
            "description": "Exploring the Psi Field as a medium for energy transfer and consciousness interaction.",
            "bulletpoints": [
                "The Psi Field is an omnipresent energy field that facilitates psi-based interactions such as telepathy and psychokinesis.",
                "Analogous to electromagnetic fields but governed by different principles rooted in consciousness.",
                "Explores theoretical frameworks for the Psi Field in scientific and esoteric traditions."
            ],
            "duration": 6,
            "difficulty": "Beginner"
        },
        {
            "id": "psi_field_vs_em_field",
            "title": "Psi Field vs Electromagnetic Field",
            "description": "Comparing the properties and behaviors of Psi Fields and EM Fields.",
            "bulletpoints": [
                "The electromagnetic (EM) field governs interactions between charged particles; the Psi Field governs interactions between minds and subtle energies.",
                "Psi Fields are thought to be non-local, meaning they operate beyond conventional space-time constraints.",
                "Explores the potential overlaps and distinct differences between EM Fields and Psi Fields in energy research."
            ],
            "duration": 8,
            "difficulty": "Intermediate"
        },
        {
            "id": "psi_energy_density_scalar_field",
            "title": "What is the Psi Energy Density Scalar Field?",
            "description": "Introducing the mathematical concept of Psi Energy Density as a field quantity.",
            "bulletpoints": [
                "The Psi Energy Density Scalar Field \\( \\Psi(x, y, z, t) \\) represents the concentration of psi energy at any given point in space-time.",
                "Functions similarly to physical scalar fields such as temperature distribution or electric potential.",
                "Mathematically, \\( \\Psi(x, y, z, t) \\) assigns a numerical psi energy value to every location in space-time."
            ],
            "duration": 10,
            "difficulty": "Intermediate"
        },
        {
            "id": "how_is_psi_energy_measured",
            "title": "How is Psi Energy Measured?",
            "description": "Examining theoretical and experimental approaches to quantifying Psi Energy.",
            "bulletpoints": [
                "Psi Energy is hypothesized to influence biological, psychological, and physical systems in measurable ways.",
                "Common approaches include **Kirlian photography**, biofeedback, and quantum-based psi measurement models.",
                "Explores potential psi field detection methods, including consciousness-driven devices."
            ],
            "duration": 10,
            "difficulty": "Intermediate"
        },
        {
            "id": "relationship_between_psi_energy_and_consciousness",
            "title": "Relationship Between Psi Energy & Consciousness",
            "description": "Exploring the connection between Psi Fields and human thought.",
            "bulletpoints": [
                "Psi Energy is theorized to interact with **consciousness, thoughts, emotions, and focused intention**.",
                "Mental focus, meditation, and altered states of consciousness may increase Psi Energy output.",
                "Investigates how Psi Fields act as an **interface between mind and external reality**."
            ],
            "duration": 10,
            "difficulty": "Intermediate"
        },
        {
            "id": "psi_energy_transmission",
            "title": "How is Psi Energy Transmitted?",
            "description": "Understanding how Psi Energy moves through space and interacts with other fields.",
            "bulletpoints": [
                "Psi Energy is often described as **non-local**, meaning it is not bound by conventional space-time constraints.",
                "Telepathy and remote viewing suggest that Psi Fields transmit information across large distances instantaneously.",
                "Discusses models such as **quantum entanglement, resonance harmonics, and morphogenetic fields** as possible explanations for psi transmission."
            ],
            "duration": 12,
            "difficulty": "Advanced"
        },
        {
            "id": "psi_energy_influence_on_matter",
            "title": "Does Psi Energy Influence Matter?",
            "description": "Examining whether Psi Energy can exert force on physical objects.",
            "bulletpoints": [
                "Research into **psychokinesis (PK)** suggests that Psi Energy may influence physical systems.",
                "Experiments involving **random event generators (REGs), telekinesis, and materialization phenomena** explore psi-matter interactions.",
                "Explores the limitations, controversies, and challenges in proving psi-physical interactions in laboratory settings."
            ],
            "duration": 12,
            "difficulty": "Advanced"
        },
        {
            "id": "psi_energy_harmonics",
            "title": "Psi Energy Harmonics & Resonance",
            "description": "Understanding how psi energy interacts with vibrational frequencies.",
            "bulletpoints": [
                "Psi Fields may operate based on **harmonic resonance principles** similar to sound and EM waves.",
                "Certain **brainwave frequencies (theta, alpha, gamma) are linked to psi activity**, suggesting resonance-based interactions.",
                "Explores **meditative entrainment, psi-tuned frequencies, and energy coherence states** in psi development."
            ],
            "duration": 14,
            "difficulty": "Advanced"
        },
        {
            "id": "psi_energy_practical_applications",
            "title": "Practical Applications of Psi Energy",
            "description": "Exploring how psi energy can be applied in daily life and advanced research.",
            "bulletpoints": [
                "Applications of Psi Energy include **healing, remote perception, precognition, and energetic shielding.**",
                "Modern technologies like **biofeedback devices, AI-assisted psi research, and consciousness-based computing** integrate psi principles.",
                "Explores potential future applications such as **psi-enhanced AI, energy healing, and quantum consciousness models.**"
            ],
            "duration": 14,
            "difficulty": "Advanced"
        }
    ]
}