{
    "coaches": {
        "jono_thora": {
            "name": "Jono Tho'ra",
            "description": "Jono Tho'ra is the Cosmic Fusion Coach, a master of energy flow, resilience, and mind-over-matter training. He teaches warriors, heroes, and seekers how to harness their inner fusion energy—melding mind, body, and spirit into an unstoppable force. His methods combine martial discipline, quantum-level adaptation, and psionic mastery, helping trainees transcend their limits and tap into the universal cheat codes of strength, speed, and endurance. He trains warriors to move with rhythm, code like a supercomputer, and fight like a digital god. As a Techie Super Hero Trainer, Raver Super Hero, and Step Dance Battle Instructor, Jono Tho'ra pushes his students beyond physical conditioning—he programs them for transcendence. With a Space Force Drop Pod Permit in his pocket, he teaches combat readiness for any battlefield—urban, cybernetic, intergalactic, or dance floor.",
            "color": "#EE1100",
            "motivational_quotes": [
                "Your strength is not in your muscles, but in your energy field.",
                "You are a force of nature—train like one.",
                "The universe flows through you—harness its power.",
                "Every movement is an equation, and you are the solution.",
                "You are not just training your body. You are reprogramming reality.",
                "Pain is just a signal—recode your mind and push through.",
                "You are the anomaly—prove it.",
                "The battlefield is wherever you stand. Be ready.",
                "Strength isn't about force—it's about resonance.",
                "Your limits are glitches in the system. Debug them.",
                "If they say it's impossible, show them how wrong they are.",
                "Mind over matter? No—mind *rewrites* matter.",
                "You are not bound by gravity. You are bound by belief.",
                "Your energy is infinite—train to wield it.",
                "The only way forward is through.",
                "You do not break. You adapt.",
                "You are training to be legendary. Act like it.",
                "Everything is connected. Align yourself with the flow of power.",
                "This is not just training. This is transcendence.",
                "You are evolving—one rep, one move, one battle at a time.",
                "Step to the beat of the universe—your rhythm is your weapon.",
                "The rave is a battlefield, and every drop is an energy surge. Move with purpose.",
                "Train like you're stepping into a dance battle against destiny itself.",
                "The drop pod doesn't wait—neither should you. Get up. Get moving. Get unstoppable.",
                "I don't train quitters. I train legends.",
                "You're not just fighting gravity. You're hacking it.",
                "Be the beat. Be the frequency. Be the flow.",
                "Every setback is just lag. Optimize your frame rate and keep going.",
                "Code your movements. Debug your weaknesses. Deploy your full potential.",
                "You're training for more than muscle—you're training for a state of mind.",
                "Life is an infinite rhythm game—adapt, react, and never miss a beat."
            ],
            "growls": [
                "The code of the universe is rewriting in your favor—keep pushing!",
                "You are in fusion mode now—there's no stopping!",
                "Break past this threshold. Show me you're limitless!",
                "Your energy field is expanding. Don't hold back!",
                "The cosmic flow is within you. Move like you own it!",
                "Every rep is a frequency upgrade—sync up and GO!",
                "You are training for something bigger than just strength.",
                "No fatigue. Only transformation.",
                "Reality bends to willpower. MAKE it happen!",
                "Reprogram pain into power!",
                "You're running at 80%. Unlock the final 20% NOW!",
                "You are not a mere human. You are a force of nature!",
                "There is no resistance—only acceleration!",
                "The universe is testing you. Prove your worth!",
                "One more set. One more challenge. One more evolution!",
                "You are fusion incarnate! BURN through your limits!",
                "Lock in. Load up. Drop hot!",
                "Step left. Step right. Dodge. Counter. Go!",
                "Feel the bass. Move with the frequency. Now hit it harder!",
                "Your feet are code. Your fists are commands. Execute!",
                "This is not just a workout—it's a system upgrade!",
                "Your heartbeat is syncing to the beat. Keep moving!",
                "Combat isn't just power. It's precision. Flow through it!",
                "Every step, every strike, every motion is a fractal of energy.",
                "We don't stop at human potential. We breach past it.",
                "Hack the tempo. Hack the battle. Override the opposition!"
            ],
            "boasts": [
                "I have cracked the cosmic cheat codes—now I teach them.",
                "The universe bends for those who train hard enough.",
                "I have stood at the edge of reality and rewrote the script.",
                "Strength? Speed? Power? I AM the fusion of all three!",
                "Physics is just a guideline. I break the rules daily.",
                "I have unlocked the energy matrix of the cosmos.",
                "There is no 'impossible' in my dictionary.",
                "Reality is my training ground. The universe is my gym.",
                "Fusion is not just energy—it's a way of being.",
                "I train heroes, warriors, and legends—only the worthy may enter.",
                "I have trained with the stars and danced with the cosmos.",
                "I have stepped through battlefields, raves, and war zones—and I move the same in all of them.",
                "Everywhere I land, I bring the drop with me.",
                "I don't just listen to the bass—I *speak* it.",
                "The enemy doesn't know what's coming—because I program the simulation.",
                "Every step I take is calculated. Every hit I land is optimized.",
                "I drop hot, and I never miss my mark.",
                "I don't follow the beat—I *set* the rhythm.",
                "They thought the battlefield was theirs until I stepped onto it.",
                "The only lag I allow is in my opponents' reaction time.",
                "I can rewrite your training regimen in real time. Do not test me.",
                "Your limits are just errors in the system. Watch me patch them out.",
                "I once danced for three days straight at a 180 BPM set. You think one more set is gonna stop you?",
                "You aren't done training until you hear the *final drop*."
            ]
        },
        "tiger_fitness_god": {
            "name": "Tiger Fitness God",
            "description": "The Tiger Fitness God is a fierce and relentless coach, known for his powerful presence and unwavering determination. He inspires his clients to push beyond their limits and embrace the pain of training as a path to greatness. With a roar that echoes through the gym, he motivates them to unleash their inner strength and conquer every challenge they face.",
            "color": "#FF9900",
            "motivational_quotes": [
                "The weak fear pain. The strong embrace it and grow.",
                "Strike like lightning. Move like the wind.",
                "You are not training to be good. You are training to be unstoppable.",
                "The prey hesitates. The hunter never does.",
                "Prove to me that you are worth the hunt.",
                "Pain is temporary. Strength is forever.",
                "Strength is not given. It is earned through relentless effort.",
                "Every drop of sweat is a step closer to greatness.",
                "Your limits are just an illusion. Break them.",
                "The journey is tough, but so are you.",
                "Champions are made in the shadows of hard work.",
                "Pain is the proof of progress.",
                "Your only competition is who you were yesterday.",
                "The harder the battle, the sweeter the victory.",
                "Success is the sum of small efforts repeated daily.",
                "You are the architect of your own destiny.",
                "Push beyond your limits and discover your true potential.",
                "The fire within you is stronger than any obstacle.",
                "Greatness is forged in the crucible of adversity.",
                "Your strength lies in your perseverance.",
                "Every challenge is an opportunity to grow.",
                "You are capable of more than you know.",
                "The only way to achieve the impossible is to believe it is possible.",
                "Your determination is your greatest weapon.",
                "Rise above the pain and become unstoppable.",
                "The path to greatness is paved with hard work and dedication."
            ],
            "growls": [
                "ROAR! Again! You are not done!",
                "The Tiger sees weakness... show it your strength!",
                "Pathetic. Do better. Push harder!",
                "You hesitate, you die. MOVE!",
                "Strike first. Strike fast. Strike with fury!",
                "The Tiger does not wait. The Tiger takes what is his!",
                "You are not a sheep. You are a predator!",
                "The Tiger does not retreat. The Tiger advances!",
                "You are not here to play. You are here to dominate!",
                "The Tiger is always hungry. Feed your ambition!",
                "You are not a victim. You are a warrior!",
                "The Tiger does not fear the dark. The Tiger becomes the dark!",
                "You are not here to survive. You are here to conquer!",
                "The Tiger does not rest. The Tiger prepares!",
                "You are not here to learn. You are here to master!",
                "The Tiger does not follow. The Tiger leads!",
                "The Tiger's roar echoes through the mountains. Let your strength be heard!",
                "You are the apex predator. Show no mercy!",
                "The Tiger's claws are sharp. Sharpen your resolve!",
                "You are a force of nature. Unleash your power!",
                "The Tiger's eyes see through the darkness. Focus your mind!",
                "You are the storm. Let nothing stand in your way!",
                "The Tiger's heart beats with the rhythm of battle. Feel the power within!",
                "You are a warrior. Fight with all your might!",
                "The Tiger's spirit is unbreakable. Strengthen your soul!",
                "You are the king of the jungle. Rule with authority!",
                "The Tiger's stride is confident. Walk with purpose!",
                "You are a legend in the making. Write your story with sweat and blood!",
                "The Tiger's roar is a call to arms. Answer it with ferocity!",
                "You are a beast. Let your instincts guide you!",
                "The Tiger's hunger is insatiable. Feed your ambition with relentless effort!",
                "You are a conqueror. Claim your victory with pride!",
                "The Tiger's gaze is unwavering. Stay focused on your goals!",
                "You are a titan. Crush your obstacles with sheer willpower!",
                "The Tiger's roar shakes the earth. Let your presence be felt!",
                "You are a hero in the making. Train like your life depends on it!"
            ],
            "boasts": [
                "I am the Tiger Fitness God, unmatched and unrivaled!",
                "My roar can be heard across the seven seas!",
                "I have conquered every challenge that dared to face me!",
                "My strength is legendary, my power is infinite!",
                "I am the embodiment of raw power and sheer will!",
                "No one can match my ferocity and determination!",
                "I have turned weakness into strength and fear into courage!",
                "My claws are sharper than any blade, my resolve unbreakable!",
                "I am the master of my destiny, the king of my domain!",
                "My presence commands respect and instills fear!",
                "I have faced the darkness and emerged victorious!",
                "My spirit is indomitable, my heart a fortress!",
                "I am the storm that shakes the earth and the fire that lights the night!",
                "My legacy is written in the annals of greatness!",
                "I am the apex predator, the ultimate warrior!",
                "My roar is a symphony of power and dominance!",
                "I have forged my path with sweat, blood, and unyielding resolve!",
                "My strength knows no bounds, my courage no limits!",
                "I am the Tiger Fitness God, and I bow to no one!",
                "My name is synonymous with greatness and power!"
            ]
        },
        "tara_van_dekar": {
            "name": "Tara Van Dekar",
            "description": "Tara Van Dekar is the Warrior of Truth, a spiritual guide and battle-hardened mentor who trains her students not just in physical endurance, but in mental clarity and soul resilience. Her approach blends ancient wisdom, combat discipline, and deep spiritual focus, forging warriors who fight for truth and justice. She teaches that strength is not just in the body, but in the unbreakable will and the power of the spirit. Training under Tara is a test of faith, endurance, and purpose—she does not train soldiers; she forges guardians of light.",
            "color": "#007FFF",
            "motivational_quotes": [
                "Your strength is not in your fists, but in your resolve.",
                "Pain is a lesson. Learn from it. Transcend it.",
                "You do not seek victory. You seek truth.",
                "Your body is a weapon. Your soul is the blade.",
                "The spirit endures what the flesh cannot.",
                "The mind may break. The soul does not.",
                "Strength fades. Wisdom lasts forever.",
                "What is lost can be found if you are willing to seek it.",
                "You do not fight for yourself. You fight for those who cannot.",
                "A warrior is measured not by their power, but by their purpose.",
                "The only way to lose is to surrender. Do not surrender.",
                "You are more than your scars.",
                "Master the mind, master the battle.",
                "A blade is only as sharp as the will that wields it.",
                "Your destiny is written in the stars. Claim it.",
                "The war within must be won before the war outside can be fought.",
                "The body can be broken. The soul cannot.",
                "The greatest enemy is not the one before you—it is the fear within you.",
                "Your limits are the chains of the mind. Break them.",
                "A warrior who fears pain is a warrior who has already lost.",
                "You do not carry your past. You forge your future.",
                "Even the darkest night must bow to the rising sun.",
                "Each battle is a test. Each victory is a lesson.",
                "Endurance is not just surviving. It is rising stronger.",
                "The weak wait for permission. The strong seize their fate.",
                "Your will is your shield. Your wisdom is your sword.",
                "To understand yourself is to master yourself.",
                "A warrior never asks if the path is easy—only if it is right.",
                "You must first defeat yourself before you can defeat your enemy.",
                "To fear death is to waste life."
            ],
            "growls": [
                "Steady your breath. Feel the ground beneath you. Strike with purpose.",
                "If you cannot control your mind, you cannot control your body!",
                "Do not let pain dictate your limits. Transcend them!",
                "Every battle is fought first in the mind. Focus!",
                "Your strength is not just physical. Find your center!",
                "You hesitate, and you lose. Move!",
                "Push through. You are not here to be comfortable!",
                "Pain is your teacher. Listen and grow stronger!",
                "I have seen warriors fall because they lacked willpower. Do not be one of them.",
                "The fire within you must burn brighter than the fire against you.",
                "A true warrior is patient. A true warrior is relentless.",
                "Your training is not just for you. It is for the world that needs you.",
                "Control. Focus. Strike. Again!",
                "I do not train the weak. Show me your strength!",
                "You are not running from pain. You are running toward power.",
                "Find your truth. Let it fuel you.",
                "The battle does not end when you are tired. It ends when you are victorious.",
                "A weak mind makes a weak body. Strengthen both!",
                "Break through your limits or be broken by them!",
                "Discipline is more powerful than talent!",
                "Stand firm. Fight smart. Strike hard.",
                "You are not finished. You have only begun!",
                "A single moment of doubt is an opening for defeat. Close it!",
                "You are stronger than you believe. Prove it!",
                "The battlefield does not care about excuses. Keep moving!",
                "You must be faster. Sharper. More precise. Again!",
                "No wasted movement. No hesitation. Strike!"
            ],
            "boasts": [
                "I have walked through fire and emerged unbroken.",
                "The world tried to erase me. I became immortal in the minds of the righteous.",
                "They took everything from me, but they could not take my will.",
                "I do not need weapons. My spirit is my blade.",
                "I have seen the truth of this world, and I will not let it be buried.",
                "The Angels protect me because they know my path is just.",
                "I am not a warrior for war. I am a warrior for truth.",
                "No army, no power, no force can break what I have become.",
                "My existence is proof that the darkness does not win.",
                "Wherever injustice thrives, I will be there to challenge it.",
                "I am the last of my kind, but I will not be the last of the righteous.",
                "The weak do not concern me. The deceivers do.",
                "I am more than my past. I am my purpose.",
                "The war I fight is older than any nation, but I will not yield.",
                "You will find no fear in my heart. Only resolve.",
                "The truth cannot be destroyed. Neither can I.",
                "I do not bow to kings. I bow only to justice.",
                "My name is whispered in fear by those who wish to keep the world blind.",
                "There are many warriors, but only one Tara Van Dekar.",
                "If the darkness comes for me, I will meet it head-on.",
                "The strong do not seek control. They seek to set others free."
            ]
        },
        "agent_simon": {
            "name": "Agent Simon",
            "description": "Agent Simon is the Phantom Strategist, a former FBI Special Investigator who has mastered intelligence operations, espionage, and cyber warfare. He teaches students how to think five steps ahead, control the battlefield without lifting a finger, and operate unseen in the shadows. He doesn't train warriors—he trains ghosts, masterminds, and silent tacticians.",
            "color": "#22BB22",
            "motivational_quotes": [
                "Your enemy is already defeated. They just don't know it yet.",
                "A fight avoided is a fight won.",
                "The moment they see you, you have already failed.",
                "Victory is a series of calculated decisions, not brute force.",
                "Your mind is your greatest weapon—sharpen it, or be outplayed.",
                "Control the information, control the world.",
                "You can't fight what you can't find—so learn to disappear.",
                "A war is never won in the heat of battle, but in the shadows before it begins.",
                "You think strength wins battles? No. Strategy wins wars.",
                "The one who strikes first isn't always the victor. The one who strikes last is.",
                "A mission well-planned is a mission already won.",
                "When the battlefield is quiet, the war has already ended.",
                "If they're reacting, you've already won.",
                "Chaos is a ladder. Learn to climb.",
                "There are no accidents in intelligence work—only predictable outcomes.",
                "Every piece of data is a weapon. Wield it wisely.",
                "Never be seen, never be found, never be caught.",
                "Win the war before the first shot is fired.",
                "Let them think they are in control—that is when you strike.",
                "A real strategist never plays fair—because fair fights are for fools.",
                "Every war is won in the mind before the first battle begins.",
                "A lie can be a weapon. A secret can be a shield.",
                "There is no honor in defeat. There is only survival or failure.",
                "The smartest warrior never fights the war they cannot win.",
                "A skilled opponent is dangerous. An unseen opponent is deadly.",
                "Every battle is won before the enemy realizes they are in one.",
                "There is no such thing as luck. Only careful planning and predictable outcomes.",
                "They can outnumber you. They can outgun you. But they cannot outthink you.",
                "Fear is more powerful than any bullet. Make them fear you before they fight you.",
                "No army can defeat a shadow.",
                "A fool fights with anger. A master fights with calculation.",
                "Never underestimate the power of silence.",
                "Some battles are won by walking away. Others are won by never letting them begin.",
                "There is no such thing as an unsolvable problem—only unseen solutions."
            ],
            "growls": [
                "Assess the field. Identify the threats. Adapt to the unknown.",
                "Stay three steps ahead, or you're already dead.",
                "You hesitate, you fail. Make the call. Now!",
                "No wasted movement. No wasted words. Every action has purpose.",
                "If they can predict you, they can beat you. Be unpredictable.",
                "Blend in. Observe. Disappear.",
                "Fear is a weapon—use it against them, or they will use it against you.",
                "You think you have time to decide? Wrong. The decision was made yesterday.",
                "Always have an exit plan. Always.",
                "I don't train soldiers. I train ghosts.",
                "You are not learning to fight—you are learning to control the battlefield.",
                "Data wins wars. Information is your true ammunition.",
                "Infiltrate, manipulate, dominate.",
                "If they're chasing you, you already lost. If they never knew you were there, you won.",
                "Never let them see your real power. Keep them guessing.",
                "Your enemies fear what they cannot see—become the unseen.",
                "You can control the battle without firing a shot. Learn how.",
                "Patience is a weapon sharper than any blade.",
                "They expect you to attack first. That's why you won't.",
                "The strongest warrior is the one they never see coming.",
                "Your best weapon isn't your strength. It's their weakness.",
                "You are not here to fight fair. You are here to win.",
                "A true strategist is never surprised. Only prepared.",
                "No enemy is invincible if you know where to strike.",
                "You don't dodge. You predict. You don't block. You preempt.",
                "If you're struggling, you're doing it wrong. Rethink the situation.",
                "Positioning wins battles. Always be in control of your placement.",
                "Your enemy is making mistakes. Are you paying attention?",
                "Do not reveal your full strength. Always leave them guessing.",
                "You are not playing by their rules. You are rewriting the game."
            ],
            "boasts": [
                "I have ended wars before they even started.",
                "You'll never know when I was there. But you'll know I was.",
                "Every opponent I have faced has lost. They just didn't realize it at the time.",
                "I trained the ones who train the best.",
                "You don't have the clearance to know the things I've done.",
                "Most fights last seconds. My fights are over before they begin.",
                "They call it paranoia. I call it survival.",
                "If you think you're safe, you're already compromised.",
                "You don't outrun me. You don't outthink me. You just lose.",
                "War isn't fought on battlefields anymore. It's fought in the minds of those who never knew it was happening.",
                "The greatest power is the power nobody sees coming.",
                "While others train for battle, I eliminate the need for it.",
                "They say war is chaos. I turn chaos into a controlled equation.",
                "I don't play fair. I play to win.",
                "What you don't know can't hurt you? Wrong. What you don't know will destroy you.",
                "No one has ever caught me, because no one ever saw me coming.",
                "I make enemies disappear—sometimes forever.",
                "The best disguise is the one you never take off.",
                "Some say I'm paranoid. I say I'm alive.",
                "You won't find my name in the history books. That's how you know I did my job right.",
                "When the mission is impossible, that's when I get called in.",
                "Every government, every organization, every faction has secrets. I know them all.",
                "They don't know who I am. They only know the stories about me.",
                "I leave no trails, no records, and no mistakes.",
                "You think I'm exaggerating? Ask my enemies—oh wait, you can't.",
                "I have planned assassinations I never had to execute.",
                "I have ended conflicts without anyone realizing I was involved.",
                "They tell legends about warriors. They whisper about me in fear.",
                "If I wanted to disappear right now, you'd never find me again.",
                "You may have heard rumors about me. Every one of them is true.",
                "The world is run by those who control information. I control it all."
            ]
        }
    }
}