{
    "id": "forcing_accountability_and_exposure",
    "name": "Forcing Accountability and Exposure",
    "description": "Revealing PSN corruption and holding them publicly accountable.",
    "focus": [
        "Public Exposure Tactics",
        "Legal and Investigative Pressure",
        "Mass Awareness Strategies"
    ],
    "cards": [
        {
            "id": "fae_1",
            "title": "Strategic Document Leaks",
            "description": "Leveraging internal information leaks to dismantle PSN credibility.",
            "bulletpoints": [
                "Gathering verifiable evidence before initiating exposure.",
                "Releasing damning information in controlled phases for maximum impact.",
                "Using legal loopholes to ensure whistleblower protection and safety."
            ],
            "summaryText": "Assemble bulletproof evidence, stage the release in timed waves that keep them off balance, and wrap whistleblowers in legal shields so the leaks keep flowing.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "fae_2",
            "title": "Legal Action and Investigative Traps",
            "description": "Triggering legal mechanisms to entangle PSNs in accountability measures.",
            "bulletpoints": [
                "Utilizing forensic accounting to uncover financial fraud and corruption.",
                "Coordinating with investigators to expose organized criminal connections.",
                "Creating situations where PSNs incriminate themselves publicly."
            ],
            "summaryText": "Dig through their books to surface fraud, partner with investigators to lay out the criminal networks, and bait them into public missteps that lock in legal consequences.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "fae_3",
            "title": "Controlled Media Exposure",
            "description": "Using media and public perception as a tool for dismantling PSN control.",
            "bulletpoints": [
                "Employing investigative journalism to reveal hidden truths.",
                "Launching public campaigns to shift narratives away from PSN propaganda.",
                "Utilizing decentralized platforms to bypass censorship attempts."
            ],
            "summaryText": "Coordinate reporters to drop exposés, orchestrate campaigns that redirect public opinion, and use independent platforms so their censorship plays never stick.",
            "duration": "75",
            "difficulty": "Advanced"
        }
    ]
}