{
    "id": "spiritual_cleansing_protocols",
    "name": "Spiritual Cleansing Protocols",
    "description": "Deep-cleansing techniques to detoxify the body, mind, and spirit from lingering energetic attachments.",
    "focus": [
        "Energetic Detox",
        "Mental and Spiritual Purification"
    ],
    "cards": [
        {
            "id": "cleanse_1",
            "title": "The Salt and Smoke Purge",
            "description": "Using salt and sacred smoke to purify spaces, objects, and personal energy fields.",
            "bulletpoints": [
                "Create protective salt barriers to absorb and neutralize negative energy.",
                "Use sacred herbs like sage, palo santo, or cedar to cleanse lingering attachments.",
                "Combine smoke and salt purification for a full energetic reset."
            ],
            "summaryText": "Lay salt barriers, burn sacred smoke, and pair them for a full-spectrum purge.",
            "duration": "60",
            "difficulty": "Intermediate"
        },
        {
            "id": "cleanse_2",
            "title": "Spiritual Bathing Rituals",
            "description": "Harnessing water and minerals to cleanse energetic toxins from the body.",
            "bulletpoints": [
                "Infuse bathwater with healing herbs and essential oils for spiritual detoxification.",
                "Charge water under the full moon or sunlight to amplify cleansing effects.",
                "Incorporate sound frequencies or affirmations while bathing for deeper purification."
            ],
            "summaryText": "Soak in charged, herb-infused water while layering sound or affirmations to clear every strand of energy.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "cleanse_3",
            "title": "Full Moon and Solar Purification",
            "description": "Using lunar and solar energies to recharge and purify the energetic body.",
            "bulletpoints": [
                "Absorb moonlight to clear emotional blockages and intuitive distortions.",
                "Use direct sunlight to recharge energy fields and burn away negativity.",
                "Perform chakra alignment exercises while connecting to celestial forces."
            ],
            "summaryText": "Stand in moon and sun, align your chakras, and let celestial energy purge and recharge you.",
            "duration": "90",
            "difficulty": "Advanced"
        },
        {
            "id": "cleanse_4",
            "title": "Sound Frequency Detox",
            "description": "Using vibrational healing through sound to dissolve energetic blockages.",
            "bulletpoints": [
                "Listen to solfeggio frequencies or binaural beats to recalibrate energy fields.",
                "Chant mantras or use singing bowls to break stagnant energetic patterns.",
                "Incorporate tuning forks or chimes to restore harmonic resonance."
            ],
            "summaryText": "Flood your field with healing frequencies, mantras, and tuning forks to dissolve blockages.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "cleanse_5",
            "title": "Fire Purification Ceremony",
            "description": "Harnessing fire as a symbolic and energetic force of transformation and renewal.",
            "bulletpoints": [
                "Burn written intentions or objects tied to negative influences as a release ritual.",
                "Use candle flames for focused energy clearing and meditation.",
                "Visualize fire consuming residual emotional and psychic blockages."
            ],
            "summaryText": "Feed the fire your old ties, meditate on the flame, and watch the blockages burn away.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "cleanse_6",
            "title": "Earth Grounding and Rebalancing",
            "description": "Using earth’s stabilizing energy to drain away negativity and restore balance.",
            "bulletpoints": [
                "Walk barefoot on soil or grass to discharge excess energetic buildup.",
                "Bury objects or personal items to reset their energetic imprints.",
                "Use clay, mud, or earth-based minerals for deep grounding practices."
            ],
            "summaryText": "Ground through bare feet, earth-based rituals, and burial resets to restore balance.",
            "duration": "60",
            "difficulty": "Intermediate"
        },
        {
            "id": "cleanse_7",
            "title": "Breathwork and Energy Circulation",
            "description": "Using controlled breathing to cleanse and circulate life force energy.",
            "bulletpoints": [
                "Perform deep breathing exercises to clear stagnant energy from the body.",
                "Use rapid breath techniques to purge emotional residues and increase vitality.",
                "Visualize energy flow aligning with each inhale and exhale."
            ],
            "summaryText": "Cycle breath through your system—slow or rapid—while visualizing energy flushing clean.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "cleanse_8",
            "title": "Mirror Reflection Purification",
            "description": "Using mirrors to reflect away negative energy and psychic projections.",
            "bulletpoints": [
                "Stand before a mirror and visualize all negative energy bouncing away.",
                "Place a charged mirror in a space to redirect intrusive forces.",
                "Break or dispose of an old mirror to symbolize release of toxic influences."
            ],
            "summaryText": "Use mirrors to reflect negativity out, anchor protection, and break old mirrors to finalize the release.",
            "duration": "90",
            "difficulty": "Advanced"
        },
        {
            "id": "cleanse_9",
            "title": "Crystal Energy Clearing",
            "description": "Utilizing crystals to absorb, transmute, and neutralize toxic energy.",
            "bulletpoints": [
                "Use black tourmaline or obsidian to pull out negative influences.",
                "Charge quartz or selenite to amplify purification and renewal.",
                "Place crystals under running water or sunlight to recharge and reset their energy."
            ],
            "summaryText": "Work with tourmaline, quartz, and selenite—cleansing them often—to keep your field clear.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "cleanse_10",
            "title": "Waterfall and Rain Cleansing",
            "description": "Using natural water flow to wash away stagnant energy and psychic debris.",
            "bulletpoints": [
                "Stand under a waterfall or heavy rain to cleanse and refresh the aura.",
                "Use a shower meditation imagining negativity being washed away.",
                "Collect rainwater for ritual purification and spiritual renewal."
            ],
            "summaryText": "Let waterfalls, rain, or shower meditations rinse you clean, and save rainwater for future rituals.",
            "duration": "90",
            "difficulty": "Expert"
        }
    ]
}