{
    "id": "mass_media_analysis",
    "name": "Mass Media Analysis",
    "description": "Training in dissecting media sources, identifying bias, and uncovering manipulative narratives.",
    "focus": [
        "Media Ownership & Influence",
        "Bias Detection & Narrative Engineering",
        "Disinformation Exposure & Verification Techniques"
    ],
    "cards": [
        {
            "id": "mass_media_1",
            "title": "Tracing Media Ownership & Influence",
            "description": "Understanding how media conglomerates shape public perception.",
            "bulletpoints": [
                "Map out major media conglomerates and their ownership structures.",
                "Analyze financial and political ties influencing editorial decisions.",
                "Cross-check sources to detect corporate media alignment with state narratives."
            ],
            "summaryText": "Chart conglomerate ownership, follow money-pressure, and cross-check for state-media sync.",
            "duration": "90",
            "difficulty": "Advanced"
        },
        {
            "id": "mass_media_2",
            "title": "Detecting Bias in News Reporting",
            "description": "Identifying slanted reporting and engineered public perception.",
            "bulletpoints": [
                "Break down linguistic framing techniques that skew perception.",
                "Compare coverage across politically opposed outlets for discrepancies.",
                "Recognize omission of key details and one-sided reporting patterns."
            ],
            "summaryText": "Dissect framing language, juxtapose rival outlets, and flag omission-heavy pieces.",
            "duration": "75",
            "difficulty": "Intermediate"
        },
        {
            "id": "mass_media_3",
            "title": "Fake News & Disinformation Spotting",
            "description": "Distinguishing between real and fabricated narratives.",
            "bulletpoints": [
                "Cross-reference key claims with independent investigative sources.",
                "Use metadata and image analysis tools to verify authenticity.",
                "Identify the hallmarks of AI-generated or bot-amplified news."
            ],
            "summaryText": "Verify claims with independent digs, probe metadata, and spot synthetic or bot-boosted items.",
            "duration": "90",
            "difficulty": "Advanced"
        },
        {
            "id": "mass_media_4",
            "title": "Media Manipulation Through Crisis Events",
            "description": "Understanding how mass events are framed for agenda-setting.",
            "bulletpoints": [
                "Analyze crisis response timing and coordinated media messaging.",
                "Identify government or corporate beneficiaries of crisis narratives.",
                "Examine historical crisis media coverage for pattern recognition."
            ],
            "summaryText": "Time crisis messaging, note who profits, and compare with past agenda-driving events.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "mass_media_5",
            "title": "Statistical Manipulation in News Reporting",
            "description": "Understanding how data is used to mislead or reinforce bias.",
            "bulletpoints": [
                "Break down misleading statistical graphics and partial data representation.",
                "Expose polling biases and survey question manipulation techniques.",
                "Analyze economic and crime statistics for selective reporting patterns."
            ],
            "summaryText": "Decode skewed charts, audit polls for bias, and review stats for cherry-picking.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "mass_media_6",
            "title": "Coordinated Narratives & Talking Points",
            "description": "Recognizing synchronized information campaigns.",
            "bulletpoints": [
                "Compare language patterns across multiple media outlets to detect scripted content.",
                "Use archive tools to identify coordinated phrase deployments over time.",
                "Track government press releases and corporate PR sources influencing narratives."
            ],
            "summaryText": "Scan outlets for copy-paste scripts, mine archives for phrasing waves, and tie messaging to PR feeds.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "mass_media_7",
            "title": "Psychological Effects of Repeated Exposure",
            "description": "Understanding how repetitive media narratives shape behavior.",
            "bulletpoints": [
                "Identify the mechanisms of cognitive reinforcement and desensitization.",
                "Recognize overuse of fear-based reporting to condition public compliance.",
                "Counteract repetitive programming through active cognitive rewiring exercises."
            ],
            "summaryText": "Understand repetition effects, call out fear cycles, and retrain thinking to break loops.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "mass_media_8",
            "title": "Social Media & Algorithmic Amplification",
            "description": "Analyzing how online media is curated for influence.",
            "bulletpoints": [
                "Investigate algorithm bias in content recommendation systems.",
                "Identify bot-driven engagement designed to fabricate trends.",
                "Use shadowbanning and suppression pattern analysis to detect information control."
            ],
            "summaryText": "Audit algorithm bias, expose bot-swell trends, and watch for suppression fingerprints.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "mass_media_9",
            "title": "Propaganda in Entertainment Media",
            "description": "Dissecting movies, music, and TV shows for subtle influence.",
            "bulletpoints": [
                "Analyze subliminal messaging in popular culture and entertainment.",
                "Track predictive programming elements linked to real-world policy changes.",
                "Distinguish organic storytelling from government-backed narrative seeding."
            ],
            "summaryText": "Spot subliminal cues, match scripts to policy shifts, and separate natural art from seeded propaganda.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "mass_media_10",
            "title": "Developing Independent Verification Systems",
            "description": "Creating personal and team-based analysis methodologies.",
            "bulletpoints": [
                "Assemble a multi-source cross-checking process for fact validation.",
                "Utilize open-source intelligence (OSINT) tools to verify claims in real-time.",
                "Develop a network of trusted researchers and analysts for information sharing."
            ],
            "summaryText": "Build rigorous cross-check workflows, leverage OSINT live, and collaborate with trusted analysts.",
            "duration": "120",
            "difficulty": "Expert"
        }
    ]
}