{
    "id": "social_contagion_disruption",
    "name": "Social Contagion Disruption",
    "description": "Neutralizing PSN-driven social influence campaigns and preventing their spread.",
    "focus": [
        "Disrupting Manipulative Trends",
        "Countering Viral Disinformation",
        "Blocking PSN Groupthink"
    ],
    "cards": [
        {
            "id": "scd_1",
            "title": "Identifying Social Manipulation Campaigns",
            "description": "Detecting and mapping PSN attempts to manufacture social movements.",
            "bulletpoints": [
                "Recognizing coordinated trends designed to push PSN narratives.",
                "Analyzing engagement patterns for artificial amplification.",
                "Tracing message origins to uncover manipulation hubs."
            ],
            "summaryText": "Spot the synthetic spikes in conversation, dissect engagement data for bot-like amplification, and trace every viral push back to the PSN cells orchestrating it.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "scd_2",
            "title": "Preemptively Undermining PSN Influence",
            "description": "Using counter-narratives and proactive disruption techniques.",
            "bulletpoints": [
                "Introducing subtle skepticism to weaken mass influence.",
                "Deploying alternative narratives before PSNs gain traction.",
                "Using humor and satire to delegitimize manipulative messaging."
            ],
            "summaryText": "Seed quiet doubt as soon as their push begins, launch competing narratives ahead of their tipping point, and weaponize humor to make their messaging look ridiculous and unsafe to share.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "scd_3",
            "title": "Breaking PSN Social Conditioning",
            "description": "Reducing the effectiveness of long-term PSN behavioral influence.",
            "bulletpoints": [
                "Educating the public on covert social engineering techniques.",
                "Creating mental immunity against manipulative persuasion.",
                "Counteracting cult-like social dynamics in targeted groups."
            ],
            "summaryText": "Teach communities how covert influence really works, build resilience drills that inoculate them against emotional hooks, and systematically dismantle the cult-style feedback loops PSNs depend on.",
            "duration": "90",
            "difficulty": "Expert"
        }
    ]
}