{
    "id": "influence_network_mapping",
    "name": "Influence Network Mapping",
    "description": "Training in identifying and mapping networks of influence used in psychological operations, disinformation campaigns, and propaganda distribution.",
    "focus": [
        "Social Influence Analysis",
        "Network Propagation Tracking",
        "Identifying Key Manipulators"
    ],
    "cards": [
        {
            "id": "influence_network_1",
            "title": "Introduction to Influence Networks",
            "description": "Understanding how influence networks operate to shape public perception and behavior.",
            "bulletpoints": [
                "Defining influence networks in media, politics, and social movements.",
                "Recognizing the key actors in psychological operations.",
                "Differentiating organic vs. artificial influence campaigns."
            ],
            "duration": "60",
            "difficulty": "Intermediate",
            "summaryText": "Define influence webs, list psyops actors, and separate organic buzz from engineered pushes."
        },
        {
            "id": "influence_network_2",
            "title": "Identifying Key Nodes in Influence Networks",
            "description": "Detecting the most influential individuals and groups within a network.",
            "bulletpoints": [
                "Analyzing key opinion leaders and their reach.",
                "Understanding gatekeeping and agenda-setting roles.",
                "Mapping direct and indirect connections within influence networks."
            ],
            "duration": "90",
            "difficulty": "Advanced",
            "summaryText": "Profile opinion leaders, note gatekeepers, and chart how power flows through the network."
        },
        {
            "id": "influence_network_3",
            "title": "Tracking Narrative Propagation",
            "description": "Following the flow of narratives through digital and traditional media ecosystems.",
            "bulletpoints": [
                "Identifying the origin points of viral misinformation.",
                "Understanding amplification tactics used in coordinated campaigns.",
                "Using OSINT tools to trace the spread of narratives."
            ],
            "duration": "75",
            "difficulty": "Advanced",
            "summaryText": "Trace narrative origins, log amplification paths, and use OSINT to follow signal spread."
        },
        {
            "id": "influence_network_4",
            "title": "Recognizing Controlled Opposition",
            "description": "Detecting influence agents posing as independent voices while serving hidden agendas.",
            "bulletpoints": [
                "Identifying inconsistencies in messaging patterns.",
                "Analyzing funding sources and affiliations.",
                "Using behavioral analysis to detect scripted narratives."
            ],
            "duration": "75",
            "difficulty": "Advanced",
            "summaryText": "Expose scripted dissent, audit funding trails, and flag behavior that betrays hidden agendas."
        },
        {
            "id": "influence_network_5",
            "title": "Bot and Sockpuppet Account Detection",
            "description": "Identifying automated and fake social media accounts used to manipulate narratives.",
            "bulletpoints": [
                "Recognizing engagement anomalies and inorganic activity spikes.",
                "Using network graphing tools to map coordinated bot behavior.",
                "Distinguishing AI-generated vs. human-authored content."
            ],
            "duration": "90",
            "difficulty": "Expert",
            "summaryText": "Spot bot spikes, map coordinated clusters, and distinguish AI chatter from human voices."
        },
        {
            "id": "influence_network_6",
            "title": "Disrupting Influence Networks",
            "description": "Strategies to neutralize the effectiveness of coordinated disinformation networks.",
            "bulletpoints": [
                "Creating counter-narratives to weaken disinformation campaigns.",
                "Identifying and exposing key propagators of false narratives.",
                "Using ethical hacking and OSINT techniques to dismantle influence operations."
            ],
            "duration": "90",
            "difficulty": "Expert",
            "summaryText": "Launch counter-stories, unmask propagators, and wield ethical OSINT to break networks apart."
        },
        {
            "id": "influence_network_7",
            "title": "Analyzing Corporate & State Influence Operations",
            "description": "Mapping how corporations, intelligence agencies, and governments shape public perception.",
            "bulletpoints": [
                "Recognizing corporate media control and narrative alignment.",
                "Tracing the financial and institutional connections behind media outlets.",
                "Understanding covert state-sponsored disinformation strategies."
            ],
            "duration": "75",
            "difficulty": "Advanced",
            "summaryText": "Decode corporate-state alliances, follow funding pipelines, and log covert propaganda tactics."
        },
        {
            "id": "influence_network_8",
            "title": "Psychological Manipulation Tactics in Influence Networks",
            "description": "Breaking down the psychological methods used to condition public perception.",
            "bulletpoints": [
                "Recognizing the use of fear, division, and emotional appeals.",
                "Analyzing linguistic patterns and framing techniques.",
                "Identifying social engineering tactics in influence campaigns."
            ],
            "duration": "90",
            "difficulty": "Expert",
            "summaryText": "Identify emotional levers, analyze framing language, and catch social engineering in motion."
        },
        {
            "id": "influence_network_9",
            "title": "Open-Source Intelligence (OSINT) for Influence Mapping",
            "description": "Leveraging OSINT methodologies to track, analyze, and expose influence networks.",
            "bulletpoints": [
                "Using advanced search queries and data mining for network analysis.",
                "Mapping social media connections and content dissemination.",
                "Employing visualization tools to track influence campaigns."
            ],
            "duration": "90",
            "difficulty": "Expert",
            "summaryText": "Combine search hacks, map social graphs, and visualize influence footprints across platforms."
        },
        {
            "id": "influence_network_10",
            "title": "Future Trends in Influence Warfare",
            "description": "Exploring how influence networks will evolve with AI, deepfakes, and next-gen PsyOps.",
            "bulletpoints": [
                "Understanding the integration of AI in psychological operations.",
                "Predicting emerging influence tactics in the digital age.",
                "Developing countermeasures for next-generation narrative warfare."
            ],
            "duration": "90",
            "difficulty": "Expert",
            "summaryText": "Project AI-enhanced psyops, anticipate new tactics, and design defenses for tomorrow’s influence wars."
        }
    ]
}