{
    "id": "maintaining_psychological_autonomy",
    "name": "Maintaining Psychological Autonomy",
    "description": "Developing mental resilience and independence to avoid future manipulation.",
    "focus": [
        "Building Internal Validation",
        "Emotional Self-Regulation",
        "Establishing Personal Boundaries"
    ],
    "cards": [
        {
            "id": "mpa_1",
            "title": "Building a Self-Sustaining Identity",
            "description": "Ensuring that your sense of self is not dependent on external validation.",
            "bulletpoints": [
                "PSNs manipulate individuals by making their self-worth dependent on approval.",
                "Developing independent self-evaluation prevents emotional hijacking.",
                "Practicing daily self-affirmations reinforces internal stability."
            ],
            "summaryText": "See how they hook you by tying your self-worth to their approval, build your own self-evaluation system to stop emotional hijacking, and use daily self-affirmations to strengthen internal stability.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "mpa_2",
            "title": "Training the Emotional Firewall",
            "description": "Developing resilience against guilt, fear, and obligation tactics.",
            "bulletpoints": [
                "PSNs use emotional vulnerabilities as leverage to maintain control.",
                "Recognizing when emotions are externally induced allows for better control.",
                "Practicing emotional detachment during manipulative attempts strengthens immunity."
            ],
            "summaryText": "Understand they exploit your emotional weak spots as leverage, spot when emotions are artificially triggered to regain control, and practice detaching during manipulation attempts to build immunity.",
            "duration": "90",
            "difficulty": "Expert"
        },
        {
            "id": "mpa_3",
            "title": "Reinforcing Boundaries Under Pressure",
            "description": "Maintaining firm personal boundaries even in high-pressure situations.",
            "bulletpoints": [
                "PSNs test boundaries through repeated encroachment.",
                "Consistency in boundary reinforcement conditions others to respect them.",
                "Using non-negotiable statements rather than explanations prevents manipulation."
            ],
            "summaryText": "Know they keep pushing your boundaries to see what they can get away with, stay consistent in reinforcing limits to train them to respect boundaries, and use firm statements without explanations to block manipulation.",
            "duration": "90",
            "difficulty": "Expert"
        }
    ]
}