{
    "id": "deflecting_manipulative_language",
    "name": "Deflecting Manipulative Language",
    "description": "Techniques for identifying and neutralizing manipulation in real-time without escalating conflicts.",
    "focus": [
        "Identifying Manipulative Phrases",
        "Breaking Conversational Control Loops",
        "Responding with Precision and Authority"
    ],
    "cards": [
        {
            "id": "dml_1",
            "title": "Spotting Conversational Traps",
            "description": "Recognizing subtle manipulative tactics in everyday conversations.",
            "bulletpoints": [
                "Identifying linguistic tricks like false dilemmas, guilt-tripping, and forced agreement.",
                "Detecting presuppositions embedded in statements that lead to undesired outcomes.",
                "Recognizing when emotional appeals are used to bypass logical reasoning."
            ],
            "summaryText": "Spot linguistic tricks like false dilemmas and forced agreement, detect hidden presuppositions that steer you toward unwanted outcomes, and recognize when emotional appeals bypass logic.",
            "duration": "75",
            "difficulty": "Advanced"
        },
        {
            "id": "dml_2",
            "title": "The Art of the Non-Response",
            "description": "Using silence, ambiguity, and neutrality to shut down manipulation.",
            "bulletpoints": [
                "Leveraging strategic pauses to make manipulators uncomfortable.",
                "Using non-committal responses to avoid being led into a trap.",
                "Practicing verbal minimalism to neutralize probing or leading questions."
            ],
            "summaryText": "Use strategic pauses to make manipulators uncomfortable, give non-committal responses to avoid traps, and practice verbal minimalism to neutralize probing questions.",
            "duration": "75",
            "difficulty": "Intermediate"
        },
        {
            "id": "dml_3",
            "title": "Flipping the Frame",
            "description": "Reversing manipulative narratives by shifting the conversational frame.",
            "bulletpoints": [
                "Recognizing when a manipulator is dictating the frame of discussion.",
                "Countering accusations with reframing techniques that redirect the burden.",
                "Asking disruptive questions that force the manipulator to re-evaluate their position."
            ],
            "summaryText": "Recognize when they're controlling the frame of the discussion, counter accusations with reframing to redirect the burden, and ask disruptive questions that force them to reassess their position.",
            "duration": "90",
            "difficulty": "Expert"
        }
    ]
}