{
    "id": "identifying_covert_narcissism",
    "name": "Identifying Covert Narcissism",
    "description": "Recognizing the more subtle and passive-aggressive traits of covert narcissists.",
    "focus": [
        "Passive-Aggressive Manipulation",
        "Hidden Insecurity and Control",
        "Emotional Drain Avoidance"
    ],
    "cards": [
        {
            "id": "icn_1",
            "title": "Recognizing Victimhood as a Manipulation Tool",
            "description": "Understanding how covert narcissists weaponize victim status.",
            "bulletpoints": [
                "They often exaggerate hardships to justify entitled behavior.",
                "Subtle guilt-tripping and emotional manipulation are common tactics.",
                "Watch for patterns of blaming others while avoiding accountability."
            ],
            "summaryText": "See how they inflate suffering to excuse bad behavior, detect the quiet guilt trips that steer you into compliance, and note the endless blame-shifting that dodges all accountability.",
            "duration": "75",
            "difficulty": "Intermediate"
        },
        {
            "id": "icn_2",
            "title": "Detecting Passive-Aggressive Sabotage",
            "description": "Identifying subtle attacks and psychological undermining.",
            "bulletpoints": [
                "Covert narcissists use sarcasm, backhanded compliments, and silent treatment.",
                "They often create confusion by presenting mixed signals and emotional inconsistency.",
                "Watch for patterns of subtle undermining and indirect criticism."
            ],
            "summaryText": "Catch the snark, fake-praise, and freeze-outs that hurt without leaving marks, recognize the constant mixed messages that scramble your thinking, and track the quiet digs that erode confidence over time.",
            "duration": "75",
            "difficulty": "Intermediate"
        },
        {
            "id": "icn_3",
            "title": "The Energy Drain Trap",
            "description": "How covert narcissists drain emotional and mental energy over time.",
            "bulletpoints": [
                "They create drama and emotional dependency to stay in control.",
                "Conversations feel exhausting rather than uplifting.",
                "They subtly erode confidence through constant micro-manipulations."
            ],
            "summaryText": "Spot the manufactured drama and dependency hooks that keep you tethered, notice when every interaction leaves you drained instead of lifted, and see the death-by-a-thousand-cuts erosion of your self-belief.",
            "duration": "90",
            "difficulty": "Advanced"
        }
    ]
}